app/views/users/_form.html.erb

SELECT "authorizations"."provider" FROM "authorizations"  WHERE "authorizations"."user_id" = $1  [["user_id", 1]]
---

  <% if current_user.authorizations.pluck(:provider).include?(provider.to_s) %>