app/controllers/carousels_controller.rb

  def index
    @carousels = Carousel.all.order_by_id
---
SELECT "carousels".* FROM "carousels"   ORDER BY "carousels"."id" ASC

  def create
    @carousel = Carousel.new(carousel_params)

    respond_to do |format|
      if @carousel.save
---
INSERT INTO "carousels" ("caption", "created_at", "image", "promotion", "title", "updated_at", "visible") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @carousel = load_carousel

    respond_to do |format|
      if @carousel.update(carousel_params)
---
UPDATE "carousels" SET "image" = $1, "promotion" = $2, "updated_at" = $3 WHERE "carousels"."id" = 3  [["image", "img3.jpg"], ["promotion", "t"], ["updated_at", "2014-10-15 11:31:04.130221"]]

  def destroy
    @carousel = load_carousel

    if @carousel.destroy
---
DELETE FROM "carousels" WHERE "carousels"."id" = $1  [["id", 5]]

    def load_carousel
      Carousel.find(params[:id])
---
SELECT  "carousels".* FROM "carousels"  WHERE "carousels"."id" = $1 LIMIT 1  [["id", 5]]