app/controllers/welcome_controller.rb

  def index
    @carousels = Carousel.only_visible.order_by_id
---
SELECT "carousels".* FROM "carousels"  WHERE "carousels"."visible" = 't'  ORDER BY "carousels"."id" ASC